----------------------------------------------------------------------------------<br />
当メールは自動送信メールです。<br />
----------------------------------------------------------------------------------
<br />
{{ $company }} 様
<br />
株式会社SMGです。
<br />
いつも「SMG貸し会議室」をご利用頂き、  <br />
誠にありがとうございます。
<br />
早速ですが、下記ご予約の  <br />
料金の支払いにつきまして、期日が近づいて参りましたので<br />
ご連絡を差し上げました。  <br />
お忙しい所恐れ入りますが、<br />
支払期日までにお振込下さいますようお願い致します。<br />
※本メールと入れ違いにご入金頂いている場合は、<br />
何卒ご容赦下さいませ。
<br />
なお、本メールは自動配信のため、複数日お申込み頂いている場合は、  <br />
連日のご連絡となる可能性がございます。悪しからずご了承下さい。
──────────────── <br />
【内容】 <br />
──────────────── <br />
・会員ID： {{ $user_id }} <br />
・カテゴリ： {{ $category }} <br />
・予約ID： {{ $reservation_id }} <br />
・ご利用日： {{ $reserve_date }} <br />
・ご利用時間： {{ $enter_time }}～ {{ $leave_time }} <br />
・会場：{{ $venue_name }} <br />
・請求書No：{{ $invoice_number }} <br />
・料金：{{ $master_total }} 円 <br />
・支払期日：{{ $payment_limit }} <br />
・会場URL：　{{ $smg_url }} <br />
──────────────── <br />
▼SMG銀行口座情報 <br />
銀行名　：関西みらい銀行　堀江支店 <br />
口座番号：普通　0088187　 <br />
口座名義：ｶ)ｴｽｴﾑｼﾞｰ <br />
※お支払いについて <br />
https://osaka-conference.com/flow/#step3 <br />
──────────────── <br />
【請求書について】 <br />
請求書は会員マイページからダウンロードが可能です。<br />
▼マイページログイン画面<br />
<a href="{{url('/user/login')}}">マイページ</a><br />
───────────────<br />
ご不明な点がございましたら気軽にお問合せ下さい。<br />
どうぞよろしくお願い致します。
----------------------------------------------------------------------------------
※万一、本メールにお心当たりがない場合は、 <br />
大変お手数ですが下記署名欄の連絡先までお知らせ下さい。 <br />
---------------------------------------------------------------------------------  <br />
SMG貸し会議室（株式会社SMG）  <br />
〒550-0014   <br />
大阪市西区北堀江1-6-2 サンワールドビル11F  <br />
TEL: 0665566462　FAX: 0665384315  <br />
（受付時間：平日10時～18時）  <br />
E-mail: kaigi@s-mg.co.jp  <br />
HP: {{url('/')}}  <br />
----------------------------------------------------------------------------------