<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;




class UsersTableSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    factory(\App\Models\User::class, 100)->create();

    // DB::table('users')->truncate();
    // $firstname_random = collect(['宮城', '松村', '石原', '後藤', '松村', '安部', '石原', '河原', '山根', '佐伯', '上原', '吉本', '神谷', '小柳', '齋藤', '小山', '伊東', '福田', '菊地', '森本', '西尾', '亀井', '木村', '徳田', '木村', '白川', '鈴木', '平岡', '今井', '緒方', '岡崎', '浅田', '大崎', '川崎', '山根', '吉沢', '大森', '片山', '篠崎', '長沢', '原', '永野', '武田', '神谷', '古賀', '吉村', '白川', '酒井', '三好', '三上']);
    // $lastname_random = collect(['光保', '光保', '佐十郎', '照也', '軍市', '理恵子', '勝信', '洋昌', '征吾', '織枝', '善二', '歩', '結衣', '荘介', '慶太郎', '美波留', '暉一郎', '治行', '歩', '三佐男', '麻里子', '生三', '美喜夫', '美哉', '慶太郎', '史男', '道和', '栄理子', '泰美', 'ハルノ', '昌光', '陽子', '久江', '運吉', '圭織', '裕仁', '豊司', '里江子', '正宣', '武久', '直広', '雅臣', '一智', '恒之', '圭織', '保行', '彩', '幸博', '恵理', '常一']);
    // $first_kana_random = collect(['ミヤギ', 'マツムラ', 'イシハラ', 'ゴトウ', 'マツムラ', 'アベ', 'イシハラ', 'カワハラ', 'ヤマネ', 'サイキ', 'ウエハラ', 'ヨシモト', 'カミタニ', 'コヤナギ', 'サイトウ', 'オヤマ', 'イトウ', 'フクタ', 'キクチ', 'モリモト', 'ニシオ', 'カメイ', 'キムラ', 'トクタ', 'キムラ', 'シラカワ', 'スズキ', 'ヒラオカ', 'イマイ', 'オガタ', 'オカザキ', 'アサダ', 'オオサキ', 'カワサキ', 'ヤマネ', 'ヨシザワ', 'オオモリ', 'カタヤマ', 'シノサキ', 'ナガサワ', 'ハラ', 'ナガノ', 'タケダ', 'カミタニ', 'コガ', 'ヨシムラ', 'シラカワ', 'サカイ', 'ミヨシ', 'ミカミ']);
    // $last_kana_random = collect(['ミツホ', 'ミツホ', 'サジュウロウ', 'テルヤ', 'グンイチ', 'リエコ', 'カツノブ', 'ヒロマサ', 'セイゴ', 'オリエ', 'ゼンジ', 'アユミ', 'ユイ', 'ソウスケ', 'ケイタロウ', 'ミハル', 'キイチロウ', 'ハルユキ', 'アユミ', 'ミサオ', 'マリコ', 'イクゾウ', 'ミキオ', 'ヨシヤ', 'ケイタロウ', 'フミオ', 'ミチカズ', 'エリコ', 'ヤスミ', 'ハルノ', 'マサミツ', 'ヨウコ', 'ヒサエ', 'ウンキチ', 'カオリ', 'ヒロヒト', 'トヨシ', 'リエコ', 'マサノリ', 'タケヒサ', 'ナオヒロ', 'マサオミ', 'カズトモ', 'ツネユキ', 'カオリ', 'ヤスユキ', 'アヤ', 'ユキヒロ', 'エリ', 'ツネカズ']);
    // $tel_random = collect(['0142008063', '0247545634', '0564205957', '0335774479', '0335103192', '0898098939', '0952103142', '0858407720', '0897518280', '0792078225', '05033549210', '0770601824', '0760882572', '0550547428', '0547489456', '0156469818', '0269508243', '0220792105', '0251808415', '0339226096', '0470433838', '0283915391', '0956729493', '0278076736', '0887896042', '0285287354', '0252701310', '0458648299', '0270868533', '0868276522', '0749230348', '0153609748', '0445856851', '0832918185', '0566241382', '0765571328', '0220702304', '0540869892', '0888613682', '0465072766', '0278682836', '0330038563', '0443357928', '0331928471', '0522819548', '0772067762', '0958029268', '0780620626', '0426427947', '0225441289',]);
    // $mobile_random = collect(['07027812989', '09067174661', '09027180154', '09032026908', '09023391872', '09094595109', '07005963713', '09014443177', '07044136694', '09070524434', '07010268428', '09004014900', '09064706986', '09006056408', '09090072983', '09044666735', '09095650423', '09084757668', '09092752937', '09062437544', '09026303591', '09082971065', '09011208941', '09081262392', '09033084712', '07006401746', '09091976528', '09061661451', '09076959703', '09057016425', '09019069475', '09072016014', '07048380250', '09082096193', '07048012017', '09069996681', '07091032792', '09056706206', '09045586168', '09070866517', '07041941165', '09095241217', '09024620643', '09054988445',]);
    // $email_random = collect(['igayim1974@example.net', 'matumura1973@mxi.asp.home.ne.jp', 'ishr.sjuru@example.ad.jp', 'itinug79@plala.or.jp', 'rek.ab@tiki.ne.jp', 'ishr1982@tiki.ne.jp', 'kawahara85@plala.or.jp', 'yamane.seigo@dion.ne.jp', 'ero@sannet.ne.jp', 'znz-uhr@tiki.ne.jp', 'otomisoy2002@goo.ne.jp', 'ekusuos2006@sakura.ne.jp', 'keitarou9456@bbtec.net', 'urahim1984@odn.ne.jp', 'urtik383@excite.com', 'atukuh05@scuba-diver.jp', 'kikuti_ayumi@bbtec.net', 'nisio@infoweb.ne.jp', 'ikuzoukamei@example.jp', 'kmr-mko@hotmail.co.jp', 'yosiyaodn@odn.ne.jp', 'kimura@ocn.ne.jp', 'sirakawa_humio@example.or.jp', 'ikuzus@example.net', 'imusay@dion.ne.jp', 'ogthrn@infoseek.co.jp', 'tmsm1970@users.gr.jp', 'okuoy0108@sannet.ne.jp', 'osk_hse19700930@rakuten.co.jp', 'kwsk1986@plala.or.jp', 'nmy4460002@nifty.com', 'otihorih1983@fdt.ne.jp', 'oomori@yahoo.co.jp', 'amayatak90@nifty.jp', 'sinosaki.masanori@infoseek.jp', 'nagasawatakehisa@example.net', 'naohiro1972@sunfield.ne.jp', 'naganomasaomi@example.org', 'mtzk2007@mesh.ne.jp', 'tnyk0809@example.gr.jp', 'kaori@geocities.com', 'ysyk72@aitai.ne.jp', 'sirakawa1979@users.gr.jp', 'sakai90@gmail.com', 'isoyim0426@aitai.ne.jp', 'tnkz986@excite.com',]);
    // $postcode_random = collect(['9070451', '9890251', '7500455', '9811251', '9010513', '3320033', '8290121', '0368015', '5203116', '8400511', '9540007', '2700226', '8240817', '7980096', '5180726', '5070078', '6800404', '7991353', '6711106', '5340011', '8490113', '8493232', '3200021', '6168326', '6891312', '9390117', '8574602', '6800455', '1080073', '0392762', '7070052', '6120047', '7711704', '5040004', '5150804', '2530084', '3430842', '6128017', '9392759', '6420024', '9140147', '5950042', '7993407', '4040013', '8700109', '8820244', '9891303', '8612108', '9880231', '3900311',]);
    // $prefecture_random = collect(['沖縄県', '宮城県', '山口県', '宮城県', '沖縄県', '埼玉県', '福岡県', '青森県', '滋賀県', '佐賀県', '新潟県', '千葉県', '福岡県', '愛媛県', '三重県', '岐阜県', '鳥取県', '愛媛県', '兵庫県', '大阪府', '佐賀県', '佐賀県', '栃木県', '京都府', '鳥取県', '富山県', '長崎県', '鳥取県', '東京都', '青森県', '岡山県', '京都府', '徳島県', '岐阜県', '三重県', '神奈川県', '埼玉県', '京都府', '富山県', '和歌山県', '福井県', '大阪府', '愛媛県', '山梨県', '大分県', '宮崎県', '宮城県', '熊本県', '宮城県', '長野県',]);
    // $adr1_random = collect(['石垣市', '白石市', '下関市', '名取市', '島尻郡八重瀬町', '川口市', '築上郡築上町', '弘前市', '湖南市', '佐賀市', '見附市', '野田市', '京都郡みやこ町', '宇和島市', '名張市', '多治見市', '八頭郡八頭町', '西条市', '姫路市', '大阪市都島区', '三養基郡みやき町', '唐津市', '宇都宮市', '京都市右京区', '鳥取市', '高岡市', '南松浦郡新上五島町', '八頭郡八頭町', '港区', '上北郡七戸町', '美作市', '京都市伏見区', '阿波市', '各務原市', '松阪市', '茅ヶ崎市', '越谷市', '京都市伏見区', '富山市', '海南市', '敦賀市', '泉大津市', '大洲市', '山梨市', '大分市', '延岡市', '柴田郡村田町', '熊本市東区', '気仙沼市', '松本市',]);
    // $adr2_random = collect(['桴海43893', '益岡町2-15-19', '豊田町城戸37574', '愛島台43843', '玻名城38308', '並木元町43893', '松丸37446', '中瓦ケ町43938', '雨山36951', '富士町鎌原43871', '下鳥町3-17-19', '東宝珠花43880', '勝山岩熊43924', '本九島37166', '本町37607', '高根町43876', '見槻中38245', '三津屋南43925', '広畑区京見町43849', '高倉町36929', '東尾4-18-16', '相知町久保4-14-10', '東塙田4-18-15', '嵯峨野東田町37243', '佐治町高山37696', '福岡町福岡新37240', '曽根郷3-19-12', '土師百井1-18-3', '三田43935', '二ツ森家ノ下37756', '位田37111', '深草大亀谷内膳町38089', '阿波町山ノ神38171', '尾崎西町43907', '大平尾町2-19-14', '円蔵4-18-8', '蒲生旭町37482', '桃山南大島町43928', '婦中町友坂37747', '阪井4-17-6', '関37183', '高津町37964', '長浜町黒田甲3-15-5', '牧丘町窪平43835', '徳島37410', '北方町早中4-20-13', '薄木1-16-19', '昭和町43842', '長磯浜37261', '水汲3-16-19',]);
    // $adr3_random = collect(['レジデンス益岡町407', '豊田町城戸ガーデン112', 'レジデンス並木元町119', 'ザ松丸301', 'ガーデン下鳥町302', 'プラザ勝山岩熊400', '本九島グリーン404', 'タワー本町400', 'パレス東塙田309', '土師百井プレシャス113', 'ヴィレッジ二ツ森家ノ下311', 'スイート位田404', '婦中町友坂ステーション311', 'リバーサイド阪井111', '徳島シーサイド100', '薄木プレイス200', '昭和町荘118', '水汲ヴィレッジ218',]);
    // $company_name = collect(['アーキテクツ・スタジオ・ジャパン', 'アークス', 'アークランドサービスホールディングス', 'アークランドサカモト', 'アース製薬', 'アートスパークホールディングス', 'アートネイチャー', 'アーバネットコーポレーション', 'アーバンビジョン', 'アールエイジ', 'アール・エス・シー', 'ＲＳ　Ｔｅｃｈｎｏｌｏｇｉｅｓ', 'アールシーコア', 'ＲＰＡホールディングス', 'アールビバン', 'ＲＶＨ', 'アーレスティ', 'アイ・アール　ジャパンホールディングス', 'アイエーグループ', 'ＩＨＩ', 'アイ・エス・ビー', 'アイエックス・ナレッジ', 'ＩＭＶ', 'アイ・オー・データ機器', 'アイカ工業', '愛眼', 'アイキューブドシステムズ', 'アイケイ', 'アイ・ケイ・ケイ', '愛光電気', 'アイコム', '藍澤證券', '愛三工業', 'アイサンテクノロジー', 'ＩＣＤＡホールディングス', 'ＩＧポート', 'ＩＪＴテクノロジーホールディングス', 'アイシン精機', 'アイスタイル', 'アイダエンジニアリング', '愛知銀行', 'アイチ　コーポレーション', '愛知製鋼', '愛知時計電機', 'ＩＴｂｏｏｋホールディングス', 'アイティフォー', 'アイティメディア', 'アイ・テック', 'ＩＤＥＣ', 'アイドママーケティングコミュニケーション',]);
    // $attr_random = collect([1, 2, 3]);
    // for ($i = 1; $i < 30; $i++) {
    //   DB::table('users')->insert(
    //     [
    //       'email'             => $i . $email_random->random(),
    //       'password'          => Hash::make('12345678'),
    //       'remember_token'    => Str::random(10),
    //       'company'    => $company_name->random(),
    //       'post_code'    => $postcode_random->random(),
    //       'address1'    => $prefecture_random->random(),
    //       'address2'    => $adr1_random->random(),
    //       'address3'    => $adr2_random->random(),
    //       'address_remark'    => '',
    //       'url'    => 'https://web-trickster.com/',
    //       'attr'    => $attr_random->random(),
    //       'condition'    => '',
    //       'first_name'    => $firstname_random->random(),
    //       'last_name'    => $lastname_random->random(),
    //       'first_name_kana'    => $first_kana_random->random(),
    //       'last_name_kana'    => $last_kana_random->random(),
    //       'mobile'    => $mobile_random->random(),
    //       'tel'    => $tel_random->random(),
    //       'fax'    => $tel_random->random(),
    //       'pay_method'    => $attr_random->random(),
    //       'pay_limit'    => $attr_random->random(),
    //       'pay_post_code'    => $postcode_random->random(),
    //       'pay_address1'    => $prefecture_random->random(),
    //       'pay_address2'    => $adr1_random->random(),
    //       'pay_address3'    => $adr2_random->random(),
    //       'pay_remark'    => $adr3_random->random(),
    //       'attention'    => '',
    //       'remark'    => '',
    //       'status' => '1'
    //     ]
    //   );
    // }
    // DB::table('users')->insert(
    //   [
    //     'email'             => 'user@example.com',
    //     'password'          => Hash::make('12345678'),
    //     'remember_token'    => Str::random(10),
    //     'company'    => $company_name->random(),
    //     'post_code'    => $postcode_random->random(),
    //     'address1'    => $prefecture_random->random(),
    //     'address2'    => $adr1_random->random(),
    //     'address3'    => $adr2_random->random(),
    //     'address_remark'    => '',
    //     'url'    => 'https://web-trickster.com/',
    //     'attr'    => $attr_random->random(),
    //     'condition'    => '',
    //     'first_name'    => $firstname_random->random(),
    //     'last_name'    => $lastname_random->random(),
    //     'first_name_kana'    => $first_kana_random->random(),
    //     'last_name_kana'    => $last_kana_random->random(),
    //     'mobile'    => $mobile_random->random(),
    //     'tel'    => $tel_random->random(),
    //     'fax'    => $tel_random->random(),
    //     'pay_method'    => $attr_random->random(),
    //     'pay_limit'    => $attr_random->random(),
    //     'pay_post_code'    => $postcode_random->random(),
    //     'pay_address1'    => $prefecture_random->random(),
    //     'pay_address2'    => $adr1_random->random(),
    //     'pay_address3'    => $adr2_random->random(),
    //     'pay_remark'    => $adr3_random->random(),
    //     'attention'    => '',
    //     'remark'    => '',
    //     'status' => '1'
    //   ]
    // );
  }
}
