<?php

return [

    /*
    |--------------------------------------------------------------------------
    | パスワードリセット言語行
    |--------------------------------------------------------------------------
    |
    | 以下の言語行は既存のパスワードを無効にしたい場合に、無効なトークンや
    | 新しいパスワードが入力された場合のように、パスワードの更新に失敗した
    | 理由を示すデフォルトの文言です。
    |
    */

    'reset' => 'パスワードをリセットしました。',
    'sent' => 'パスワードリセットメールを送信しました。',
    'token' => 'このパスワードリセットトークンは無効です。',
    'user' => "登録しているメールアドレスと一致しません。",
    'throttled' => 'すでにパスワード設定用のメールを送信しました。届かない場合はメールアドレスを変更もしくは、迷惑メールの確認をお願いします',


];
