<p>この度は、SMGアクセア貸し会議室の会員登録のお手続き<br>
  ありがとうございます。<br>
  <br>
  下記URLより、会員登録へ進んでください。<br>
  <br>
  <a href="https://staging-smg2.herokuapp.com/user/preusers/{{$id}}/{{$token}}/{{$email}}">リンクをクリックして認証</a><br>
  <br>
  会員登録用の上記URLに関しては、有効期限は１時間となるますので、<br>
  ご注意お願い致します。<br>
  <br>
  ※本メールはサーバーからの自動返信メールとなっております。<br>
  本メールに返信いただいてもご連絡いたしかねますのでご了承ください。<br>
  <br>
  ご要望質問がある際は下記へご連絡いただければ幸いです。<br>
  <br>
  何卒よろしくお願い致します。<br>
  <br>
  -----------------------------------<br>
  SMGアクセア貸し会議室<br>
  Email : info@osaka-conference.com<br>
  WEB : https://osaka-conference.com/<br>
  TEL : 06-1234-5678<br>
  お電話での問い合わせ（10時〜18時）<br>
  -----------------------------------<br>
</p>